{
    "title": "Jesse Leroy Adams : Petty Officer Third Class from Texas, World War II Casualty",
    "name": "Jesse Leroy Adams",
    "short_bio": "He was a World War II Era casualty on December 7, 1941.\nHe served with honor in the United States Navy.\nHe is remembered by the people of Texas\nMay his positive example inspire us, as global citizens.\nWhen we work together, we can help one another.",
    "service_overview": {
        "Name": "Jesse Leroy Adams",
        "From": "Grayson County, Texas",
        "Born": "January 15, 1920",
        "Death": "December 7, 1941",
        "War": "World War II",
        "ID": "3562884",
        "Rank": "Petty Officer Third Class",
        "Specialty": "Gunner's Mate Third Class",
        "Branch": "US Navy",
        "Group": "USS Tennessee",
        "Cause": "Hostile, Killed in Action",
        "Location": "Pearl Harbor, Hawaii",
        "Awarded": "★ Purple Heart"
    },
    "full_info": {
        "ORIGINS": "Jesse Leroy Adams was born on January 15, 1920. According to our records Texas was his home or enlistment state and Grayson County included within the archival record. We have Denison listed as the city.",
        "SERVICE": "He had enlisted in the United States Navy. Served during World War II. Adams had the rank of Petty Officer Third Class. His military occupation or specialty was Gunner's Mate Third Class. Service number assignment was 3562884. Attached to USS Tennessee.",
        "CASUALTY": "During his service in World War II, Navy Petty Officer Third Class Adams experienced a traumatic event which ultimately resulted in loss of life on December 7, 1941. Recorded circumstances attributed to: Killed in action. Incident location: Pearl Harbor, Hawaii.",
        "REMEMBERED": "Jesse Leroy Adams is buried or memorialized at National Memorial Cemetery of the Pacific Honolulu, Hawaii. This is an American Battle Monuments Commission location.",
        "COMMENDATIONS": "★ Purple Heart\n★ Combat Action Ribbon\n★ World War II Victory Medal\n★ American Campaign Medal\n★ Navy Presidential Unit Citation\n★ Navy Good Conduct Medal\n★ Asiatic-Pacific Campaign Medal\n★ Navy Expeditionary Medal"
    }
}